Как да използвате scm/github

1.Създайте личен профил в https://github.com/
2.Изтеглете и инсталирайте git клиента от https://git-scm.com/downloads/
3.Изтеглете и инсталирайте GUI за git: https://tortoisegit.org/download/

Последователност на действията:
- от repo с адрес напр: https://github.com/ITCareer2021/02.Programming 
може да създадете локално копие на наличните в репо-то файлове/папки на Вашия компютър, върху които да работите. 
Това е действието Pull (изтегляне) или git clone в празна папка за създаване на ново копие от репо.

- промени върху файлове

- отразяване на направените промени commit->Push чрез Git Sync... на папката.


